tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nektos/tap"
tap "withgraphite/tap"

brew "act"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "libyaml"
brew "openssl@3", link: false
brew "asdf"
brew "bison"
brew "bison@2.7"
brew "cdrtools"
brew "cmake"
brew "curl"
brew "freetds"
brew "php"
brew "composer"
brew "gdbm"
brew "gh"
brew "git"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gradle"
brew "pkg-config"
brew "jq"
brew "libffi"
brew "libfido2"
brew "make"
brew "mkcert"
brew "node@16"
brew "nvm"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "ruby-install"
brew "sl"
brew "tomcat@8"
brew "tree"
brew "zsh"
brew "withgraphite/tap/graphite"
brew "mas"


# Applications
cask "visual-studio-code"
cask "iterm2"
cask "fork"
cask "slack"
cask "discord"
cask "ark"
cask "google-chrome"
cask "notion"


# vscode extensions
vscode "aaron-bond.better-comments"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firsttris.vscode-jest-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "liamhammett.inline-parameters"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ko"
vscode "ms-vscode-remote.remote-containers"
vscode "naumovs.color-highlight"
vscode "PKief.material-icon-theme"
vscode "ritwickdey.LiveServer"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "tal7aouy.theme"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "WallabyJs.quokka-vscode"
vscode "wix.vscode-import-cost"
